ninjasstudio/micropython/ports/esp32/machine_pwm.c
        unsigned int res = 0;
        for (; i > 1; i >>= 1) {
            ++res;
        }
        if (res == 0) {
            res = 1;
        } else if (res > HIGHEST_PWM_RES) {
            // Limit resolution to HIGHEST_PWM_RES to match units of our duty
            res = HIGHEST_PWM_RES;
        }

        // Configure the new resolution and frequency
        timer->duty_resolution = res;
        timer->freq_hz = freq;
        timer->clk_cfg = LEDC_USE_APB_CLK;
        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            timer->clk_cfg = LEDC_USE_REF_TICK;
        }
        #endif


        self->active = true;

        // Save the same duty cycle when frequency is changed
        if (self->duty_x == HIGHEST_PWM_RES) {
            set_duty_u16(self, self->duty);
        } else if (self->duty_x == PWM_RES_10_BIT) {
            set_duty_u10(self, self->duty);
        } else if (self->duty_x == -HIGHEST_PWM_RES) {
            set_duty_ns(self, self->duty);
        }

        // Set frequency
        check_esp_err(ledc_timer_config(timer));
        // Reset the timer if low speed
        if (self->mode == LEDC_LOW_SPEED_MODE) {
            check_esp_err(ledc_timer_rst(self->mode, self->timer));
        }
    }
}

// Find a free PWM channel, also spot if our pin is already mentioned.
STATIC int find_channel(int mode, int pin) {
    PWM_DBG("find_channel(mode=%d pin=%d)", mode, pin)
    int avail_channel = -1;
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if (chans[mode][channel].pin == pin) {
            return channel;
        }
        if ((avail_channel < 0) && (chans[mode][channel].pin < 0)) {
            avail_channel = channel;
        }
    }
    return avail_channel;
}

STATIC int find_new_channel(machine_pwm_obj_t *self) {
    PWM_DBG("find_new_channel()")
    int channel = -1;
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        ////if (is_free_channel(mode)) {
            channel = find_channel(mode, self->pin);
            if (channel >= 0) {
                self->mode = mode;
                break;
            }
        ////}
    }
    if (channel < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("1 out of PWM channels:%d"), PWM_CHANNEL_MAX); // in all modes
    }
    return channel;
}

STATIC int find_free_timer_in_mode(machine_pwm_obj_t *self, int check_mode) {
    PWM_DBG("find_free_timer_in_mode(%d)", check_mode)
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        if ((check_mode < 0) || is_free_channel(check_mode, self->pin)) {
            for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
                if ((check_mode < 0) || (check_mode == mode)) {
                    if (timers[mode][timer].freq_hz == 0) {
                        self->mode = mode;
                        return timer;
                    }
                }
            }
        }
    }
    return -1;
}

// Return timer with the same mode and frequency
STATIC int find_timer(int mode, unsigned int freq) {
    PWM_DBG("find_timer(mode=%d freq=%d)", mode, freq)
    for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
        if (timers[mode][timer].freq_hz == freq) {
            return timer;
        }
    }
    return -1;
}
/*
If the frequency is changed, try to find a timer with the same frequency
in the current mode, otherwise in the next mode.
If the mode is changed, release the channel and select a new channel in the next mode.
Then set the frequency with the same duty.
*/
STATIC void select_a_timer(machine_pwm_obj_t *self, int freq) {
    PWM_DBG("select_a_timer(freq=%d mode=%d)", freq, self->mode)
    if ((freq <= 0) || (freq > 40000000)) {
        mp_raise_ValueError(MP_ERROR_TEXT("frequency must be from 1Hz to 40MHz"));
    }

    int save_timer = self->timer;
    int save_channel = self->channel;
    int save_mode = self->mode;
    if (self->mode < 0) {
        self->mode = 0;
    }

    // Check if an already running timer with the required frequency is running in the same mode
    int new_timer = -1;
    //if (is_free_channel(self->mode)) {
        new_timer = find_timer(self->mode, freq);
    //}
    if (save_mode >= 0) {
        if (!is_free_channel(self->mode, self->pin)) {
            // There is a timer, but there is no channel
            new_timer = -1;
        }
    }

    // If no existing timer and channel was found in the same mode, then find a new one in another mode
    int new_mode = self->mode;
    if (new_timer < 0) {
        // Calc next mode
        if (new_mode > 0) {
            --new_mode;
        } else if (new_mode < (LEDC_SPEED_MODE_MAX - 1)) {
            ++new_mode;
        }

        if (self->mode != new_mode) {
            #define ANY_PIN (-1)
            if (is_free_channel(new_mode, ANY_PIN)) {
                new_timer = find_timer(new_mode, freq);
                self->mode = new_mode;
            }
        }
    }
    if (new_timer >= 0) {
        if (self->timer != new_timer) {
            // Bind the channel to the new timer
            if (ledc_bind_channel_timer(self->mode, self->channel, new_timer) != ESP_OK) {
                mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("failed to bind mode %d timer %d to channel %d"), self->mode, self->channel, new_timer);
            }
            //chans[self->mode][self->channel].timer = new_timer;
        }
    }

    // If no existing timer and channel was found in any mode, then try to use self timer, mode and channel
    if (new_timer < 0) {
        if (timer_used(save_mode, save_timer) == 1) {
            new_timer = save_timer;
            self->channel = save_channel;
            self->mode = save_mode;
        }
    }

    // Try to find free timer
    if (new_timer < 0) {
        #define ANY_MODE (-1)
        new_timer = find_free_timer_in_mode(self, ANY_MODE);
    }
    if (new_timer < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), PWM_TIMER_MAX);
    }

    self->timer = new_timer;
    if ((save_mode != self->mode) || (save_channel != self->channel)) {
        unregister_channel(save_mode, save_channel);
    }
    register_channel(self->mode, self->channel, self->pin, self->timer);
}

/******************************************************************************/
// MicroPython bindings for PWM

